Courses/7140/Lectures/OODesign/OOD-2015/design-by-contract.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Object Oriented  "Design By Contract"</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Object Oriented  "Design By Contract""/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-19T01:00-0400"/>
<meta name="author" content="Prabhaker Mateti"/>
<meta name="description" content="CS7140 Software Engineering Lecture"/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../Lectures"> UP </a>
 |
 <a accesskey="H" href="../../"> HOME </a>
</div>

<div id="preamble">
<a href="http://cecs.wright.edu/~pmateti/Courses/7140/">CS 7140 Advanced Software Engineering</a>
</div>

<div id="content">
<h1 class="title">Object Oriented  "Design By Contract"</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Class Invariants</h2>
<div class="outline-text-2" id="text-1">


<ol>
<li>Consider only the public methods  
</li>
<li>Their entry- exit- assertions
</li>
<li>Rewrite, if nec, using and's (at the top level)
</li>
<li>The common portion across all the above is the <i>class invariant</i>
</li>
<li>Strongest Possible
</li>
</ol>


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> "Design By Contract"</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>Bertrand Meyer's <a href="../OOD/meyer-design-by-contract-1992-markedUp.pdf">article marked-up</a> by pmateti
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> References</h2>
<div class="outline-text-2" id="text-3">


<ol>
<li>Robert Bruce Findler, Mario Latendresse, and Matthias Felleisen.
   Behavioral Contracts and Behavioral Subtyping.  In Proceedings of
   ESEC/FSE-9,
   229-236. <a href="http://www.ccs.neu.edu/scheme/pubs/fse01-flf.pdf">http://www.ccs.neu.edu/scheme/pubs/fse01-flf.pdf</a> 2001
   Recommended Reading.

</li>
<li>Bertrand Meyer. Applying "design by contract".  IEEE Computer,
   25(10):40–51, October 1992.  
   <a href="http://se.ethz.ch/~meyer/publications/computer/contract.pdf">http://se.ethz.ch/~meyer/publications/computer/contract.pdf</a>
   Also in his book "Object-Oriented Software Construction".
   Required Reading.
</li>
</ol>


</div>
</div>
</div>

<div id="postamble">
<hr size=1>Copyright &copy; 2013 <a href="mailto:pmateti@wright.edu">pmateti@wright.edu</a> &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
